{
    "Home": "Domov",
    "Services": "Služby",
    "Education": "Vzdelanie",
    "Skills": "Zručnosti",
    "Languages": "Jazyky",
    "Experience": "Skúsenosti",
    "Contact": "Kontakt",

    "/img/us.png": "/img/sk.png",
    "/img/sk.png": "/img/us.png",
    "SVK": "ENG",
    "ENG": "SVK",
    "sk": "en",

    "Hello, I am": "Dobrý deň, som",
    "Informatics Student / Freelance Translator": "Študent informatiky / Prekladateľ",
    "I am an informatics student with a strong interest in ": "Som študent informatiky so záľobou vo ",
    "web development": "vývoji webových stránok",
    "and": "a",
    "Professionally, I am currently mostly involved in": "Profesionálne sa momentálne zväčša zaoberám",
    "English-Slovak translation": "prekladom z angličtiny do slovenčiny",
    " work.": ".",
    "Every single detail matters": "Každý detail je dôležitý",
    "Self-growth and improvement is crucial": "Sebarozvoj a zlepšovanie je kľúčové",
    "Download CV": "Stiahnuť CV",
    "Contact me": "Kontaktujte ma",
    "Didn’t find what you need?": "Nenašli ste to, čo potrebujete?",
    "If the service you’re looking for is not listed, contact me! If I have the necessary skills, I am sure we can find a solution.": "Ak služba, ktorú hľadáte, nie je uvedená, kontaktujte ma! Ak mám potrebné zručnosti, som si istý, že dokážeme nájsť riešenie.",
    "My studies": "Moje štúdium",
    "What I am offering": "Moja ponuka",
    "Translation services": "Prekladateľské služby",
    "I offer precise translations between English and Slovak for documents, websites, applications, and a wide array of content with meticulous attention to accuracy and quality.": "Ponúkam presné preklady medzi angličtinou a slovenčinou pre dokumenty, webové stránky, aplikácie a širokú škálu obsahu s dôkladným dôrazom na správnosť a kvalitu.",
    "Web development": "Vývoj webových stránok",
    "With expertise in frontend and backend development, I create websites that are visually appealing and functional, focusing on user experience to leave a positive impression.": "So znalosťami v oblasti vývoja frontendu a backendu vytváram webové stránky, ktoré sú vizuálne atraktívne a funkčné, pričom sa zameriavam na používateľský zážitok, aby zanechal pozitívny dojem.",
    "Software development": "Vývoj softvéru",
    "I provide comprehensive software development services in Java and C++, ensuring tailored solutions for applications and systems to meet specific needs and standards.": "Poskytujem komplexné služby v oblasti vývoja softvéru v jazykoch Java a C++, zabezpečujúc šité riešenia pre aplikácie a systémy, ktoré spĺňajú konkrétne potreby a normy.",
    
    "Faculty of Informatics and Information Technologies": "Fakulta informatiky a informačných technológií",
    "Slovak University of Technology in Bratislava": "Slovenská technická univerzita v Bratislave",
    "Bachelor of Informatics": "Bakalár v odbore informatika",
    "High school diploma": "Maturitná skúška",
    "2022 - present": "2022 - prítomnosť",
    
    "What I am skilled at": "Moje zručnosti",

    "Additional languages": "Ďalšie jazyky",
    "My journey so far...": "Moja cesta doposiaľ...",
    "Translator (English to Slovak)": "Prekladateľ (angličtina do slovenčiny)",
    "Self-employed": "Slobodné povolanie",
    "Skilled in translating predominantly IT products with additional experience across diverse fields": "Zručný v preklade predovšetkým IT produktov s ďalšími skúsenosťami v rôznych oblastiach",
    "Collaborating with a team of translators to complete large projects efficiently and within deadlines": "Spolupráca s tímom prekladateľov na efektívne dokončenie veľkých projektov v stanovených termínoch",
    "Using various online tools (CAT) and dictionaries to research and verify technical terms and expressions": "Používanie rôznych online nástrojov (CAT) a slovníkov na výskum a overenie technických termínov a výrazov",
    "Editing and proofreading translations to ensure clarity, accuracy, and coherence": "Úprava a korektúra prekladov na zabezpečenie jasnosti, presnosti a súdržnosti",
    "Artificial intelligence prompt analyst": "Analytik umelého inteligentného návodu",
    "Extensive experience in text analysis and comparative assessment": "Rozsiahle skúsenosti s analýzou textu a porovnávacím posúdením",
    "Comparing and evaluating the outputs of different prompts for various generative AI tasks, such as text summarization, sentiment analysis, and content creation": "Porovnávanie a hodnotenie výstupov rôznych návodov pre rôzne generatívne úlohy umelej inteligencie, ako sú zhrnutia textu, analýza citov a tvorba obsahu",
    "Identifying and reporting the strengths and weaknesses of different prompts, as well as the potential ethical, cultural, and social implications of the generated outputs": "Identifikácia a hlásenie silných a slabých stránok rôznych návodov, ako aj potenciálnych etických, kultúrnych a sociálnych dôsledkov vytvorených výstupov",
    "If you wish to contact me, below you’ll find multiple ways to get in touch with me.": "Ak ma chcete kontaktovať, nižšie nájdete viacero spôsobov, ako ma kontaktovať.",
    "Contact Details:": "Kontaktné údaje:",
    "Feel free to drop me an email or give me a call if you have any questions, inquiries, or would like to discuss potential collaborations.": "Neváhajte mi napísať e-mail alebo mi zavolať, ak máte akékoľvek otázky, požiadavky alebo by ste chceli diskutovať o možných spoluprácach.",
    "Alternatively, you can use the form on the right to send me a message directly through the website. Simply fill in your details.": "Alebo môžete použiť formulár vpravo, aby ste mi mohli priamo na webe poslať správu. Stačí vyplniť svoje údaje.",
    "If you have any technical problems with or questions regarding the website, please don’t hesitate to contact me using the email below:": "Ak máte akékoľvek technické problémy alebo otázky týkajúce sa webovej stránky, neváhajte ma kontaktovať pomocou e-mailu nižšie:",
    "Looking forward to hearing from you!": "Teším sa na vašu odozvu!",
    "Made with ❤️ by Erik Roganský": "Vytvorené s ❤️ Erikom Roganským",
    "© Erik Roganský 2024. All rights reserved.": "© Erik Roganský 2024. Všetky práva vyhradené.",
    "Terms and Conditions": "Obchodné podmienky",
    "Privacy Policy": "Zásady ochrany osobných údajov"
  }
  