{
    "Home": "Domov",
    "Services": "Služby",
    "Education": "Vzdelanie",
    "Skills": "Zručnosti",
    "Languages": "Jazyky",
    "Experience": "Skúsenosti",
    "Contact": "Kontakt",

    "/img/us.png": "/img/sk.png",
    "/img/sk.png": "/img/us.png",
    "SVK": "ENG",
    "ENG": "SVK",
    "sk": "en",

    "Hello, I am": "Dobrý deň, som",
    "Informatics Student / Freelance Translator": "Študent informatiky / Prekladateľ",
    "I am an informatics student with a strong interest in ": "Som študent informatiky so záľobou vo ",
    "web development,": "vývoji webových stránok",
    "and": "a",
    "Java,": "a vo vývoji v Jave",
    "Professionally, I am currently mostly involved in": "Profesionálne sa momentálne zaoberám",
    "English-Slovak translation": "prekladom z angličtiny do slovenčiny",
    " work.": ".",
    "Every single detail matters": "Každý detail je dôležitý",
    "Self-growth and improvement is crucial": "Sebarozvoj a zlepšovanie je kľúčové",
    "Consistency and discipline are vital": "Dôslednosť a disciplína sú nevyhnutné",
    "Download CV": "Stiahnuť CV",
    "Contact me": "Kontaktujte ma",
    "Didn’t find what you need?": "Nenašli ste to, čo potrebujete?",
    "If the service you’re looking for is not listed, contact me! If I have the necessary skills, I am sure we can find a solution.": "Ak služba, ktorú hľadáte, nie je uvedená, kontaktujte ma! Ak mám potrebné zručnosti, som si istý, že dokážeme nájsť riešenie.",
    "My studies": "Moje štúdium",
    "What I am offering": "Moja ponuka",
    "Translation services": "Prekladateľské služby",
    "I offer precise translations between English and Slovak for documents, websites, applications, and a wide array of content with meticulous attention to accuracy and quality.": "Ponúkam presné preklady medzi angličtinou a slovenčinou pre dokumenty, webové stránky, aplikácie a širokú škálu obsahu s dôkladným dôrazom na správnosť a kvalitu.",
    "Web development": "Vývoj webových stránok",
    "With expertise in frontend and backend development, I create websites that are visually appealing and functional, focusing on user experience to leave a positive impression.": "So znalosťami v oblasti vývoja frontendu a backendu vytváram webové stránky, ktoré sú vizuálne atraktívne a funkčné, pričom sa zameriavam na používateľský zážitok, aby zanechal pozitívny dojem.",
    "Software development": "Vývoj softvéru",
    "I provide comprehensive software development services in Java and C++, ensuring tailored solutions for applications and systems to meet specific needs and standards.": "Poskytujem komplexné služby v oblasti vývoja softvéru v jazykoch Java a C++, zabezpečujúc šité riešenia pre aplikácie a systémy, ktoré spĺňajú konkrétne potreby a normy.",
    
    "Faculty of Informatics and Information Technologies": "Fakulta informatiky a informačných technológií",
    "Slovak University of Technology in Bratislava": "Slovenská technická univerzita v Bratislave",
    "Bachelor of Informatics": "Bakalár v odbore informatika",
    "High school diploma": "Maturitná skúška",
    "2022 - present": "2022 - prítomnosť",
    
    "What I am skilled at": "Moje zručnosti",

    "Languages I speak": "Jazykové zručnosti",
    "Additional languages": "Ďalšie jazyky",

    "English": "Anglický",
    "Slovak": "Slovenský",
    "Czech": "Český",
    "French": "Francúzsky",
    "Spanish": "Španielsky",

    "Professional working proficiency": "Profesionálne pracovné znalosti",
    "Native proficiency": "Materinský jazyk",
    "Full professional proficiency": "Úplné profesionálne znalosti",
    "Limited working profficiency": "Obmedzené pracovné znalosti",
    "Elementary proficiency": "Základné znalosti",
    "(currently learning)": "(aktuálne vo výučbe)",

    "My journey so far...": "Moje pracovné skúsenosti",
    "Translator (English to Slovak)": "Prekladateľ (angličtina do slovenčiny)",
    "Self-employed": "SZČO",
    "2023 - present": "2023 - súčasnosť",
    "Skilled in translating predominantly IT products with additional experience across diverse fields": "Zručný v preklade predovšetkým IT produktov s ďalšími skúsenosťami v rôznych oblastiach",
    "Collaborating with a team of translators to complete large projects efficiently and within deadlines": "Spolupráca s tímom prekladateľov na efektívne dokončenie veľkých projektov v stanovených termínoch",
    "Using various online tools (CAT) and dictionaries to research and verify technical terms and expressions": "Používanie rôznych online nástrojov (CAT) a slovníkov na výskum a overenie technických termínov a výrazov",
    "Editing and proofreading translations to ensure clarity, accuracy, and coherence": "Úprava a korektúra prekladov na zabezpečenie jasnosti, presnosti a súdržnosti",
    "Artificial intelligence prompt analyst": "Analytik umelého inteligentného návodu",
    "Extensive experience in text analysis and comparative assessment": "Rozsiahle skúsenosti s analýzou textu a komparatívnym hodnotením",
    "Comparing and evaluating the outputs of different prompts for various generative AI tasks, such as text summarization, sentiment analysis, and content creation": "Porovnávanie a vyhodnocovanie výstupov rôznych podnetov pre rôzne generatívne úlohy umelej inteligencie, ako je sumarizácia textu, analýza sentimentov a tvorba obsahu.",
    "Identifying and reporting the strengths and weaknesses of different prompts, as well as the potential ethical, cultural, and social implications of the generated outputs": "Identifikácia a oznamovanie silných a slabých stránok rôznych podnetov, ako aj potenciálnych etických, kultúrnych a sociálnych dôsledkov vytvorených výstupov",
    "If you wish to contact me, below you’ll find multiple ways to get in touch with me.": "Ak ma chcete kontaktovať, nižšie nájdete viacero spôsobov, ako sa so mnou spojiť.",
    "Contact Details:": "Kontaktné údaje:",
    "Phone": "Mobil",
    "Address": "Adresa",
    "Tech support:": "Technická podpora:",

    "Slovak republic": "Slovenská republika",
    "Feel free to drop me an email or give me a call if you have any questions, inquiries, or would like to discuss potential collaborations.": "Neváhajte mi napísať e-mail alebo mi zavolať, ak máte akékoľvek otázky, požiadavky alebo by ste chceli diskutovať o možných spoluprácach.",
    "Alternatively, you can use the form on the right to send me a message directly through the website. Simply fill in your details.": "Prípadne môžete použiť formulár vpravo a poslať mi správu priamo prostredníctvom webovej stránky. Stačí vyplniť svoje údaje.",
    "If you have any technical problems with or questions regarding the website, please don’t hesitate to contact me using the email below:": "Ak máte akékoľvek technické problémy alebo otázky týkajúce sa webovej stránky, neváhajte ma kontaktovať pomocou e-mailu nižšie:",
    "Looking forward to hearing from you!": "Teším sa na vaše správy!",

    "Name": "Meno",
    "Phone number (optional)": "Telefónne číslo (voliteľné)",
    "Subject": "Predmet",
    "Message": "Správa",

    "Made with ❤️ by Erik Roganský": "Vytvoril s ❤️ Erik Roganský",
    "© Erik Roganský 2024. All rights reserved.": "© Erik Roganský 2024. Všetky práva vyhradené.",
    "Terms and Conditions": "Všeobecné podmienky používania",
    "Privacy Policy": "Zásady ochrany osobných údajov",











  "Welcome to my website!": "Vitajte na mojej webovej stránke!",
  "These terms and conditions outline the rules and regulations for the use of my website, located at": "Tieto podmienky a ustanovenia vymedzujú pravidlá a predpisy týkajúce sa používania mojej webovej stránky, umiestnenej na",
  "By accessing this website, it is presumed that you accept and agree to abide by these terms and conditions. If you do not agree with any part of these terms and conditions, kindly refrain from utilizing my website.": "Vstupom na túto webovú lokalitu sa predpokladá, že súhlasíte s týmito podmienkami a súhlasíte s ich dodržiavaním. Ak nesúhlasíte s ktoroukoľvek časťou týchto podmienok, moju webovú stránku prosím nepoužívajte.",
  "License:": "Licencia:",
  "Unless otherwise stated, I, as the owner of this website, own the intellectual property rights for all material on this platform. All such rights are reserved. Access to this website is granted solely for personal use, subject to the restrictions outlined in these terms and conditions.": "Pokiaľ nie je uvedené inak, ja, ako majiteľ tejto webovej stránky, vlastním práva duševného vlastníctva na všetok materiál na tejto platforme. Všetky takéto práva sú vyhradené. Prístup k tejto webovej stránke je udelený výlučne na osobné použitie, podliehajúc obmedzeniam uvedeným v týchto podmienkach a ustanoveniach.",
  "You must not:": "Nesmiete:",
  "Copy or republish material from my website": "Kopírovať alebo publikovať materiál z mojej webovej stránky",
  "Sell, rent, or sub-license material from my website": "Predávať, prenajímať alebo poskytovať licenciu na materiál z mojej webovej stránky",
  "Reproduce, duplicate or copy material from my website": "Reprodukovať, duplikovať alebo kopírovať materiál z mojej webovej stránky",
  "Redistribute content from my website": "Rozdistribuovať obsah z mojej webovej stránky",
  "This Agreement shall begin on the date hereof.": "Táto dohoda nadobúda platnosť dňom jej uzavretia.",
  "Hyperlinking to my Content:": "Odkazovanie na môj obsah:",
  "The following organizations may link to my website without prior written approval:": "Nasledujúce organizácie môžu bez predchádzajúceho písomného súhlasu odkazovať na moju webovú stránku:",
  "Government agencies;": "Vládne agentúry,",
  "Search engines;": "Vyhľadávače,",
  "News organizations;": "Spravodajské organizácie,",
  "Online directory distributors may link to my website in the same manner as they hyperlink to the Websites of other listed businesses; and": "Distribútori online katalógov môžu odkazovať na moju webovú stránku rovnakým spôsobom, ako odkazujú na webové stránky iných uvedených podnikov a",
  "System-wide Accredited Businesses except soliciting non-profit organizations, charity shopping malls, and charity fundraising groups which may not hyperlink to my website.": "Akreditované podniky s výnimkou neziskových organizácií, charitatívnych nákupných centier a charitatívnych skupín na zbieranie finančných prostriedkov, ktoré nemusia mať odkaz na moju webovú stránku.",
  "These organizations may link to home page, to publications, or to other website information so long as the link: (a) is not in any way deceptive; (b) does not falsely imply sponsorship, endorsement, or approval of the linking party and its products and/or services; and (c) fits within the context of the linking party’s site.": "Tieto organizácie môžu odkazovať na domovskú stránku, na publikácie alebo na iné informácie na webovej stránke, pokiaľ odkaz: (a) nie je v žiadnom prípade klamlivý, (b) nepravdivo nenaznačuje sponzorstvo, podporu alebo schválenie odkazujúcej strany a jej produktov a / alebo služieb a (c) zapadá do kontextu stránky odkazujúcej stránky.",
  "I may consider and approve other link requests from the following types of organizations:": "Môžem zvážiť a schváliť ďalšie žiadosti o odkazovanie od nasledujúcich typov organizácií:",
  "commonly-known consumer and/or business information sources;": "všeobecne známe zdroje spotrebiteľských a / alebo obchodných informácií,",
  "associations or other groups representing charities;": "zväzy alebo iné skupiny zastupujúce charitatívne účely,",
  "online directory distributors;": "online distribútori adresárov,",
  "internet portals;": "internetové portály,",
  "accounting, law, and consulting firms; and": "účtovné, právne a poradenské firmy a",
  "educational institutions and trade associations.": "vzdelávacie inštitúcie a obchodné združenia.",
  "I will approve link requests from these organizations if I decide that: (a) the link would not make me look unfavorably to myself or to my accredited businesses; (b) the organization does not have any negative records with me; (c) the benefits to me from the visibility of the hyperlink compensate for the absence of explicit endorsement of my website; and (d) the link is in the context of general resource information.": "Schválim žiadosti o odkazovanie od týchto organizácií, ak sa rozhodnem, že: (a) odkaz na mňa alebo na moje akreditované podniky nebude vyzerať nepriaznivo, (b) organizácia u mňa nemá žiadne negatívne záznamy, (c) výhody pre mňa z viditeľnosti odkazu kompenzujú absenciu explicitného odporúčania mojej webovej stránky a (d) odkaz je v kontexte všeobecných informácií o zdrojoch.",
  "These organizations may link to home page so long as the link: (a) is not in any way deceptive; (b) does not falsely imply sponsorship, endorsement, or approval of the linking party and its products or services; and (c) fits within the context of the linking party’s site.": "Tieto organizácie môžu odkazovať na domovskú stránku, pokiaľ odkaz: (a) nie je v žiadnom prípade klamlivý, (b) nezavádza falošne sponzorstvo, podporu alebo schválenie strany, ktorá odkazuje a jej produktov alebo služieb a (c) zapadá do kontextu stránky strany, ktorá odkazuje.",
  "If you are one of the organizations listed in paragraph 2 above and are interested in linking to my website, you must inform me by sending an e-mail. Please include your name, your organization name, contact information as well as the URL of your site, a list of any URLs from which you intend to link to my website, and a list of the URLs on my site to which you would like to link.": "Ak patríte medzi organizácie uvedené v odseku 2 vyššie a máte záujem o odkazovanie na moju webovú stránku, musíte ma informovať zaslaním e-mailu. Uveďte svoje meno, názov svojej organizácie, kontaktné údaje, ako aj URL adresu svojej webovej stránky, zoznam všetkých URL adries, z ktorých sa chystáte odkazovať na moju webovú stránku a zoznam URL adries na mojej stránke, na ktoré by ste sa chceli odkazovať.",
  "Approved organizations may hyperlink to my website as follows:": "Schválené organizácie môžu odkazovať na moju webovú stránku nasledovne:",
  "By use of my name; or": "Použitím môjho mena, alebo",
  "By use of the uniform resource locator being linked to; or": "Použitím jednotného lokátora zdrojov, na ktorý sa odkazuje, alebo",
  "Using any other description of my website being linked to that makes sense within the context and format of content on the linking party’s site.": "Použitím akéhokoľvek iného opisu mojej webovej stránky, na ktorú sa odkazuje, ktorý má zmysel v kontexte a formáte obsahu na stránke strany, ktorá odkazuje.",
  "No use of my logo or other artwork will be allowed for linking absent a trademark license agreement.": "Žiadne použitie mojho loga alebo iných diel nebude povolené bez prítomnosti licenčnej zmluvy o ochrannej známky.",
  "Content Liability:": "Zodpovednosť za obsah:",
  "I shall not be held responsible for any content that appears on your Website. You agree to protect and defend me against all claims that are raised on your Website. No link(s) should appear on any Website that may be interpreted as libelous, obscene, or criminal, or which infringes, otherwise violates, or advocates the infringement or other violation of, any third party rights.": "Nezodpovedám sa za obsah, ktorý sa zobrazuje na vašej webovej stránke. Súhlasíte s tým, že ma ochránite a obhájite pred všetkými tvrdeniam, ktoré budú vznesené na vašej webovej stránke. Na žiadnej webovej stránke by nemali byť zobrazené žiadne odkazy, ktoré by mohli byť vykladané ako hanlivé, obscénne alebo kriminálne, alebo ktoré by porušovali, inak poškodzovali alebo propagovali porušenie alebo iné porušenie práv tretích strán.",
  "Reservation of Rights:": "Vyhradenie práv:",
  "I reserve the right to request that you remove all links or any particular link to my website. You approve to immediately remove all links to my website upon request. I also reserve the right to amend these terms and conditions and its linking policy at any time. By continuously linking to my website, you agree to be bound to and follow these linking terms and conditions.": "Vyhradzujem si právo požiadať vás, aby ste odstránili všetky odkazy alebo akýkoľvek konkrétny odkaz na moju webovú stránku. Súhlasíte s tým, že na požiadanie okamžite odstránite všetky odkazy na moju webovú stránku. Vyhradzujem si tiež právo kedykoľvek zmeniť tieto podmienky a ustanovenia a jej politiku odkazovania. Pokračovaním v odkazovaní na moju webovú stránku súhlasíte s viazaním sa a dodržiavaním týchto podmienok a ustanovení o odkazovaní.",
  "Removal of links from my website:": "Odstránenie odkazov z mojej webovej stránky:",
  "If you find any link on my website that is offensive for any reason, you are free to contact and inform me at any moment. I will consider requests to remove links, but I am not obligated to or so or to respond to you directly.": "Ak na mojej webovej stránke nájdete akýkoľvek odkaz, ktorý je urážlivý z akéhokoľvek dôvodu, máte právo kontaktovať a informovať ma kedykoľvek. Zvážim požiadavky na odstránenie odkazov, ale nie som povinný tak urobiť alebo reagovať na vás priamo.",
  "Disclaimer:": "Vylúčenie zodpovednosti:",
  "To the maximum extent permitted by applicable law, I exclude all representations, warranties, and conditions relating to my website and the use of this website. Nothing in this disclaimer will:": "Do maximálneho rozsahu, aký umožňuje platné právo, vylučujem všetky vyjadrenia, záruky a podmienky týkajúce sa mojej webovej stránky a používania tejto webovej stránky. Nič v tomto vylúčení zodpovednosti:",
  "limit or exclude my or your liability for death or personal injury;": "neobmedzí alebo nevylúči moju alebo vašu zodpovednosť za úmrtie alebo osobné zranenie,",
  "limit or exclude my or your liability for fraud or fraudulent misrepresentation;": "neobmedzí alebo nevylúči moju alebo vašu zodpovednosť za podvod alebo klamlivé zastúpenie,",
  "limit any of my or your liabilities in any way that is not permitted under applicable law; or": "neobmedzí akékoľvek moje alebo vaše záväzky takým spôsobom, ktorý nie je povolený podľa platného práva, alebo",
  "exclude any of my or your liabilities that may not be excluded under applicable law.": "nevylúči akékoľvek moje alebo vaše záväzky, ktoré nemôžu byť vylúčené podľa platného práva.",
  "The limitations and prohibitions of liability set in this Section and elsewhere in this disclaimer: (a) are subject to the preceding paragraph; and (b) govern all liabilities arising under the disclaimer, including liabilities arising in contract, in tort, and for breach of statutory duty.": "Obmedzenia a zákazy zodpovednosti uvedené v tejto časti a inde v tomto vylúčení zodpovednosti: (a) podliehajú predchádzajúcemu odseku a (b) riadia všetky záväzky vyplývajúce z vylúčenia zodpovednosti, vrátane záväzkov vznikajúcich zmluvne, z deliktu a pre porušenie zákonnej povinnosti.",
  "As long as the website and the information and services on the website are provided free of charge, I will not be liable for any loss or damage of any nature.": "Pokým sú webová stránka a informácie a služby na webovej stránke poskytované bezplatne, nezodpovedám sa za žiadnu stratu alebo škodu akéhokoľvek druhu."
  }
  